УТ_для_edt/src/InformationRegisters/смартПараметрыРасчетаСтатусовЗаказовБитрикс/смартПараметрыРасчетаСтатусовЗаказовБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартПараметрыРасчетаСтатусовЗаказовБитрикс</name>
  <comment>//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтмененыСтроки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УстановленРезерв</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Самовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БезналичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГлавныйСкладСамовывоз</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УстановленРезервНаСкладе</name>
    <comment>#2014 смарт: Лопато 23.08.2024 //Информирование клиентов о статусе заказа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВЗаказеТолькоУслуги</name>
    <comment>//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СмартСтатусыЗаказовБитрикс/СмартСтатусыЗаказовБитрикс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СмартСтатусыЗаказовБитрикс</name>
  <attributes>
    <name>СтатусЗаказа</name>
    <type>
      <types>EnumRef.смартСтатусыЗаказовБитриксЗначения</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаМет</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДсайта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СостоянияЗаказовКлиентов/СостоянияЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияЗаказовКлиентов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовКлиентов</types>
      <types>EnumRef.СостоянияЗаявокНаВозвратТоваровОтКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОтгрузки</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолга</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхожденияОрдерНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДокументыПодписаны</name>
    <comment>//++ #1650 смарт:Шляпников 17.09.2024 //Отметка &quot;Оригиналы документов получены&quot; (Заказ клиента) при частичной отгрузке (1650)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставке</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеРассчитанаСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеПоТарифу</name>
    <type>
      <types>CatalogRef.СкидкиНаценки</types>
    </type>
  </attributes>
  <attributes>
    <name>смартНаценкаПоДоставкеСуммаПоТарифу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаявкаНаВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОтгрузкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКОформлениюГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартКСборкеГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобираетсяГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартСобраноГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/ТоварыКДоставке/ТоварыКДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТоварыКДоставке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ВсеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОтправитель</name>
    <type>
      <types>DefinedType.ОтправительПолучательДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DefinedType.РаспоряжениеНаДоставку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/СмартСтатусОтслеживаниеОтправления/СмартСтатусОтслеживаниеОтправления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СмартСтатусОтслеживаниеОтправления</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусЗадания</name>
    <type>
      <types>EnumRef.СтатусыЗаданийНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрекНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыЗаказовБитриксЗначения/смартСтатусыЗаказовБитриксЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыЗаказовБитриксЗначения</name>
  <enumValues>
    <name>ПринятОжидаетсяОплата</name>
  </enumValues>
  <enumValues>
    <name>ПринятОжидаетсяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>Собирается</name>
  </enumValues>
  <enumValues>
    <name>ЗаказСобран</name>
  </enumValues>
  <enumValues>
    <name>ЗаказОтменен</name>
  </enumValues>
  <enumValues>
    <name>Доставляется</name>
  </enumValues>
  <enumValues>
    <name>ОтправленКурьером</name>
  </enumValues>
  <enumValues>
    <name>ПереданВТранспортнуюКомпанию</name>
  </enumValues>
  <enumValues>
    <name>ГотовКВыдаче</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПолучен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяОплата</name>
  </enumValues>
  <enumValues>
    <name>ОжидаютсяДокументы</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ФормыОплаты/ФормыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормыОплаты</name>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>ПлатежнаяКарта</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>БонусныеБаллы</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>МногооборотнаяТара</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/CommonModules/смарт_РаботаССтатусамиЗаказа/Module.bsl
//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Процедура смартРассчитатьПараметрыСтатусовЗаказовБитрикс(МассивЗаказов, СтруктураДействийРасчета) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	НачатьТранзакцию();
	
	//Получим текущие значения параметров
	ТекущиеЗначенияПараметровРасчета = смартПолучитьТекущиеЗначенияПараметровРасчетаСтатусовЗаказовБитрикс(МассивЗаказов); 

	//Блокировка регистра по заказам для исключения параллельного чтения/записи
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТекущиеЗначенияПараметровРасчета;  
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	БлокировкаДанных.Заблокировать();
	
	//Копируем текущие параметры для изменения
	НовыеЗначенияПараметровРасчета = ТекущиеЗначенияПараметровРасчета.Скопировать();
	
	//Расчеты параметров
	смартРассчитатьПараметрыЗаказа(МассивЗаказов, СтруктураДействийРасчета, НовыеЗначенияПараметровРасчета);
	//смартРассчитатьПараметрДоставки(МассивЗаказов, СтруктураДействийРасчета, НовыеЗначенияПараметровРасчета);
	
	//В запись попадают только строки с измененными параметрами
	ТаблицаОтличийПараметровРасчета = смартВычислитьРазличияВТаблицах(НовыеЗначенияПараметровРасчета, ТекущиеЗначенияПараметровРасчета);
	
	//Запись регистра
	Если НЕ смартЗаписатьРегистрСмартПараметрыРасчетаСтатусовЗаказовБитрикс(ТаблицаОтличийПараметровРасчета) Тогда
		ЗаписьЖурналаРегистрации("Проблема с проведением документа, не удалось записать параметры расчета статуса в регистр смартПараметрыРасчетаСтатусовЗаказовБитрикс",
								 УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	//Вычисление статусов заказов по параметрам
	смартОтразитьСостоянияЗаказовБитрикс(МассивЗаказов);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //--#1241 смарт: Лопато 25.01.2023

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Процедура смартОтразитьСостоянияЗаказовБитрикс(МассивЗаказов)

	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	//Получим текущие значения параметров
	ЗначенияПараметровРасчетаИСтатусы = смартПолучитьЗначенияПараметровРасчетаИСтатусыЗаказовБитрикс(МассивЗаказов); 

	//Блокировка регистра по заказам для исключения параллельного чтения/записи
	БлокировкаДанных = Новый БлокировкаДанных;

	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ЗначенияПараметровРасчетаИСтатусы;  
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");

	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.СмартСтатусыЗаказовБитрикс");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ЗначенияПараметровРасчетаИСтатусы;  
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СсылкаМет", "Заказ");
	
	БлокировкаДанных.Заблокировать();
	
	Для Каждого ПараметрыЗаказа Из ЗначенияПараметровРасчетаИСтатусы Цикл
		
		Заказ = ПараметрыЗаказа.Заказ;
	 	ТекСтатус = ПараметрыЗаказа.СтатусЗаказа;
		
		//Проверка что заказ уже закрыт и дальнейшие действия не нужны. 
		Если ТекСтатус = Перечисления.смартСтатусыЗаказовБитриксЗначения.Выполнен Тогда
			//Чистим регистры процессов и параметров
			смартОчиститьРегистрПроцессов(Заказ);
			смартОчиститьРегистрПараметров(Заказ);
			Продолжить;
		КонецЕсли;
		
		//++ #2020 смарт: Ермаков 03.09.2024 / Исправить логику формирования статуса "Готов к выдаче"
		//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
		//++ #Б6102 смарт: Шляпников 23.03.2026 / Проект smart-t.ru. Не выгружается финальный статус для завершенных заказов.
		//МенятьСтатус = Не (ПараметрыЗаказа.Проведен И ПараметрыЗаказа.Отгружен И ПараметрыЗаказа.Оплачен И Не ПараметрыЗаказа.Доставка) 
		//				ИЛИ (ТекСтатус = Перечисления.смартСтатусыЗаказовБитриксЗначения.ОжидаютсяДокументы И ПараметрыЗаказа.ВЗаказеТолькоУслуги);
		МенятьСтатус = Истина;
		//-- #Б6102 смарт: Шляпников 23.03.2026
		//-- #Б3854 смарт: Шляпников 01.10.2025
		
		Если МенятьСтатус Тогда
		//-- #2020 смарт: Ермаков 03.09.2024
			
			НаименованиеНовогоСтатуса = смартВычислитьСтатусЗаказаБитриксПоПараметрам(ПараметрыЗаказа);
			
			//СоответствиеСтатусовЗаказа
			СоответствиеСтатусовЗаказа = смартПолучитьСоответствиеСтатусовЗаказа();
		
			//Подготовка структуры новой записи СмартПроцессИзмененияСтатусовЗаказовБитрикс
			СтруктураЗаписиПроцесса = Новый Структура;
			СтруктураЗаписиПроцесса.Вставить("Заказ",  Заказ);
			СтруктураЗаписиПроцесса.Вставить("Период", ТекущаяДата());
			
			//Подготовка структуры новой записи СмартСтатусыЗаказовБитрикс
			СтруктураЗаписиСтатусыЗаказовБитрикс = Новый Структура;
			СтруктураЗаписиСтатусыЗаказовБитрикс.Вставить("СсылкаМет", Заказ);
			СтруктураЗаписиСтатусыЗаказовБитрикс.Вставить("ГУИД", Заказ.УникальныйИдентификатор());
			СтруктураЗаписиСтатусыЗаказовБитрикс.Вставить("СтатусЗаказа");
			СтруктураЗаписиСтатусыЗаказовБитрикс.Вставить("Идентификатор");
			
			СтруктураЗаписиПроцесса.Вставить(НаименованиеНовогоСтатуса, Истина); 
			ЗаполнитьЗначенияСвойств(СтруктураЗаписиСтатусыЗаказовБитрикс, СоответствиеСтатусовЗаказа[НаименованиеНовогоСтатуса]);
			
			//Статус изменен
			Если ТекСтатус = Неопределено ИЛИ ТекСтатус <> СтруктураЗаписиСтатусыЗаказовБитрикс.СтатусЗаказа Тогда
				
				//Запись регистра СмартСтатусыЗаказовБитрикс
				Отказ = смартЗаписатьРегистрСмартСтатусыЗаказовБитрикс(СтруктураЗаписиСтатусыЗаказовБитрикс);
				
				Если НЕ Отказ Тогда
					Если СтруктураЗаписиСтатусыЗаказовБитрикс.СтатусЗаказа = Перечисления.смартСтатусыЗаказовБитриксЗначения.Выполнен Тогда
				        //Чистим регистр процессов
						смартОчиститьРегистрПроцессов(Заказ);
						смартОчиститьРегистрПараметров(Заказ);
					Иначе
						//Запись регистра СмартПроцессИзмененияСтатусовЗаказовБитрикс
						Отказ = смартЗаписатьРегистрСмартПроцессИзмененияСтатусовЗаказовБитрикс(СтруктураЗаписиПроцесса);	
					КонецЕсли;
			    КонецЕсли; 
					
			КонецЕсли;
			
		//++ #2020 смарт: Ермаков 03.09.2024 / Исправить логику формирования статуса "Готов к выдаче"
		КонецЕсли;
		//-- #2020 смарт: Ермаков 03.09.2024
		
	КонецЦикла;	
	
	ЗафиксироватьТранзакцию();
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры //--#1241 смарт: Лопато 25.01.2023

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартВычислитьСтатусЗаказаБитриксПоПараметрам(ПараметрыЗаказа)
	
	НаименованиеНовогоСтатуса = "ВОбработке";
	
	//Вычисление статуса
	//Параметры: Проведен, ПометкаУдаления, Закрыт, ОтмененыСтроки, УстановленРезерв, Отгружен, Оплачен, Самовывоз, БезналичнаяОплата, Доставка, ГлавныйСкладСамовывоз
	Если ПараметрыЗаказа.ПометкаУдаления ИЛИ ПараметрыЗаказа.ОтмененыСтроки Тогда 
		//Заказ отменен (когда заказ в 1с помечен на удаление или закрыт с отменой всех строк)
		НаименованиеНовогоСтатуса = "Отменен";
	ИначеЕсли ПараметрыЗаказа.Закрыт Тогда 
		//Заказ завершен (когда заказ закрыт)
		НаименованиеНовогоСтатуса = "Завершен";	
	ИначеЕсли ПараметрыЗаказа.Отгружен И НЕ ПараметрыЗаказа.Оплачен Тогда 					
        //Ожидается оплата (когда заказ после отгрузки не оплачен полностью или частично)
		НаименованиеНовогоСтатуса = "ОжидаетсяОплата";
		//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
	//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
	ИначеЕсли ПараметрыЗаказа.Самовывоз И ПараметрыЗаказа.Проведен И ПараметрыЗаказа.УстановленРезервНаСкладе И Не ПараметрыЗаказа.Отгружен И ПараметрыЗаказа.ВЗаказеТолькоУслуги Тогда
		НаименованиеНовогоСтатуса = "ОжидаютсяДокументы";
	ИначеЕсли ПараметрыЗаказа.Самовывоз И ПараметрыЗаказа.Проведен И ПараметрыЗаказа.УстановленРезервНаСкладе И ПараметрыЗаказа.Отгружен И ПараметрыЗаказа.ВЗаказеТолькоУслуги Тогда
		НаименованиеНовогоСтатуса = "Получен";
	//-- #Б3854 смарт: Шляпников 01.10.2025
	//++ #2020 смарт: Ермаков 03.09.2024 / Исправить логику формирования статуса "Готов к выдаче"
	ИначеЕсли ПараметрыЗаказа.Самовывоз И ПараметрыЗаказа.Проведен И ПараметрыЗаказа.УстановленРезервНаСкладе И Не ПараметрыЗаказа.Отгружен Тогда	
	//-- #2020 смарт: Ермаков 03.09.2024
		//- если способ доставки "самовывоз" и все товары зарезервированы и способ оплаты "наличными при получении" - статус "Готов к выдаче"
		//- если способ доставки "самовывоз" и все товары зарезервированы и способ оплаты "по счету" и заказ не оплачен - статус "Принят, ожидается оплата"
		//- если способ доставки "самовывоз" и все товары зарезервированы и способ оплаты "по счету" и заказ оплачен - статус "Готов к выдаче"
		Если ПараметрыЗаказа.БезналичнаяОплата Тогда
			Если ПараметрыЗаказа.Оплачен Тогда
				НаименованиеНовогоСтатуса = "ГотовКВыдаче";
			Иначе	
				НаименованиеНовогоСтатуса = "НовыйОбъект";
			КонецЕсли;	
		Иначе
			НаименованиеНовогоСтатуса = "ГотовКВыдаче";
		КонецЕсли;	
		//-- #2020 смарт: Лопато 29.08.2024
	ИначеЕсли НЕ ПараметрыЗаказа.Самовывоз И ПараметрыЗаказа.Проведен И ПараметрыЗаказа.Доставка Тогда	
		//Доставляется (когда доставка нашими силами по городу и товар передан водителю (заказ попал в задание на перевозку))
		НаименованиеНовогоСтатуса = "Доставляется";
	ИначеЕсли ПараметрыЗаказа.Оплачен И ПараметрыЗаказа.УстановленРезерв Тогда	
		//Принят, ожидается отгрузка – когда заказ оплачен и установлен резерв
		НаименованиеНовогоСтатуса = "Оплачен";
	ИначеЕсли ПараметрыЗаказа.Проведен И ПараметрыЗаказа.УстановленРезерв Тогда	
		//Принят, ожидается оплата – когда заказ в 1с проведен и установлен резерв
		НаименованиеНовогоСтатуса = "НовыйОбъект";
	ИначеЕсли НЕ ПараметрыЗаказа.Проведен ИЛИ НЕ ПараметрыЗаказа.УстановленРезерв Тогда	
		//Заказ в обработке (когда заказ в 1с не проведен или не установлен резерв)                                                                    
		НаименованиеНовогоСтатуса = "ВОбработке";
	Иначе
		НаименованиеНовогоСтатуса = "ВОбработке";
	КонецЕсли;	

	Возврат НаименованиеНовогоСтатуса;

КонецФункции //--#1241 смарт: Лопато 25.01.2023	

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартВычислитьРазличияВТаблицах(Таблица1, Таблица2)
	
	ТаблицаРазница = Таблица1.СкопироватьКолонки();
	
	Для ИндексСтрок = 0 По Таблица1.Количество() - 1 Цикл
		
		Если Таблица1[ИндексСтрок][0] = Таблица2[ИндексСтрок][0] Тогда

			ЕстьРазличия = Ложь;
			
			Для ИндексКолонок = 1 По Таблица1.Колонки.Количество() - 1 Цикл
			
				Если Таблица2.Количество() >= (ИндексСтрок + 1) 
					И Таблица2.Колонки.Количество() >= ИндексКолонок + 1 Тогда
				
					Если Таблица1[ИндексСтрок][ИндексКолонок] <> Таблица2[ИндексСтрок][ИндексКолонок] Тогда
                        ЕстьРазличия = Истина;
						Прервать;
					КонецЕсли;
					
				КонецЕсли;
					
			КонецЦикла;	
			
			Если ЕстьРазличия Тогда
				НоваяСтрока = ТаблицаРазница.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Таблица1[ИндексСтрок]);
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат ТаблицаРазница;
	
КонецФункции //--#1241 смарт: Лопато 25.01.2023

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартПолучитьТекущиеЗначенияПараметровРасчетаСтатусовЗаказовБитрикс(МассивЗаказов)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказКлиента.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Заказ КАК Заказ,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Проведен КАК Проведен,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ПометкаУдаления КАК ПометкаУдаления,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Закрыт КАК Закрыт,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ОтмененыСтроки КАК ОтмененыСтроки,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.УстановленРезерв КАК УстановленРезерв,
	//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.УстановленРезервНаСкладе КАК УстановленРезервНаСкладе,
	//-- #2020 смарт: Лопато 29.08.2024
	//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ВЗаказеТолькоУслуги КАК ВЗаказеТолькоУслуги,
	//-- #Б3854 смарт: Шляпников 01.10.2025
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Отгружен КАК Отгружен,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Оплачен КАК Оплачен,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Самовывоз КАК Самовывоз,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.БезналичнаяОплата КАК БезналичнаяОплата,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Доставка КАК Доставка,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ГлавныйСкладСамовывоз КАК ГлавныйСкладСамовывоз
	|ПОМЕСТИТЬ ВТ_ПараметрыРасчета
	|ИЗ
	|	РегистрСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс.СрезПоследних КАК смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Заказ = ВТ_Заказы.Заказ
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс.СрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Проведен, 		    	ЛОЖЬ) КАК Проведен,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ПометкаУдаления,   	ЛОЖЬ) КАК ПометкаУдаления,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Закрыт, 		    	ЛОЖЬ) КАК Закрыт,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ОтмененыСтроки,    	ЛОЖЬ) КАК ОтмененыСтроки,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.УстановленРезерв,  	ЛОЖЬ) КАК УстановленРезерв,
	//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.УстановленРезервНаСкладе, ЛОЖЬ) КАК УстановленРезервНаСкладе,
	//-- #2020 смарт: Лопато 29.08.2024
	//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ВЗаказеТолькоУслуги, ЛОЖЬ) КАК ВЗаказеТолькоУслуги,
	//-- #Б3854 смарт: Шляпников 01.10.2025
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Отгружен, 		    	ЛОЖЬ) КАК Отгружен,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Оплачен,		    	ЛОЖЬ) КАК Оплачен,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Самовывоз, 	    	ЛОЖЬ) КАК Самовывоз,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.БезналичнаяОплата, 	ЛОЖЬ) КАК БезналичнаяОплата,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Доставка, 				ЛОЖЬ) КАК Доставка,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ГлавныйСкладСамовывоз, ЛОЖЬ) КАК ГлавныйСкладСамовывоз
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыРасчета КАК ВТ_ПараметрыРасчета
	|		ПО ВТ_Заказы.Заказ = ВТ_ПараметрыРасчета.Заказ
	|";

	Запрос.Параметры.Вставить("МассивЗаказов", МассивЗаказов);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции //--#1241 смарт: Лопато 25.01.2023	

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартПолучитьЗначенияПараметровРасчетаИСтатусыЗаказовБитрикс(МассивЗаказов)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ЗаказКлиента.Ссылка КАК Заказ
	|ПОМЕСТИТЬ ВТ_Заказы
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Заказ КАК Заказ,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Проведен КАК Проведен,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ПометкаУдаления КАК ПометкаУдаления,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Закрыт КАК Закрыт,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ОтмененыСтроки КАК ОтмененыСтроки,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.УстановленРезерв КАК УстановленРезерв,
	//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.УстановленРезервНаСкладе КАК УстановленРезервНаСкладе,
	//-- #2020 смарт: Лопато 29.08.2024
	//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ВЗаказеТолькоУслуги КАК ВЗаказеТолькоУслуги,
	//-- #Б3854 смарт: Шляпников 01.10.2025
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Отгружен КАК Отгружен,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Оплачен КАК Оплачен,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Самовывоз КАК Самовывоз,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.БезналичнаяОплата КАК БезналичнаяОплата,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Доставка КАК Доставка,
	|	смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.ГлавныйСкладСамовывоз КАК ГлавныйСкладСамовывоз
	|ПОМЕСТИТЬ ВТ_ПараметрыРасчета
	|ИЗ
	|	РегистрСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс.СрезПоследних КАК смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО смартПараметрыРасчетаСтатусовЗаказовБитриксСрезПоследних.Заказ = ВТ_Заказы.Заказ
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс.СрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(СмартСтатусыЗаказовБитрикс.СсылкаМет КАК Документ.ЗаказКлиента) КАК ЗаказСсылка,
	|	СмартСтатусыЗаказовБитрикс.СтатусЗаказа КАК СтатусЗаказа
	|ПОМЕСТИТЬ ВТ_СтатусыЗаказов
	|ИЗ
	|	РегистрСведений.СмартСтатусыЗаказовБитрикс КАК СмартСтатусыЗаказовБитрикс
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
	|		ПО ((ВЫРАЗИТЬ(СмартСтатусыЗаказовБитрикс.СсылкаМет КАК Документ.ЗаказКлиента)) = ВТ_Заказы.Заказ)
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	РегистрСведений.СмартСтатусыЗаказовБитрикс
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаказСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заказы.Заказ КАК Заказ,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Проведен, 				ЛОЖЬ) КАК Проведен,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ПометкаУдаления, 		ЛОЖЬ) КАК ПометкаУдаления,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Закрыт, 				ЛОЖЬ) КАК Закрыт,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ОтмененыСтроки, 		ЛОЖЬ) КАК ОтмененыСтроки,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.УстановленРезерв,  	ЛОЖЬ) КАК УстановленРезерв,
	//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.УстановленРезервНаСкладе, ЛОЖЬ) КАК УстановленРезервНаСкладе,
	//-- #2020 смарт: Лопато 29.08.2024
	//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ВЗаказеТолькоУслуги, ЛОЖЬ) КАК ВЗаказеТолькоУслуги,
	//-- #Б3854 смарт: Шляпников 01.10.2025
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Отгружен, 				ЛОЖЬ) КАК Отгружен,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Оплачен, 				ЛОЖЬ) КАК Оплачен,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Самовывоз, 			ЛОЖЬ) КАК Самовывоз,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.БезналичнаяОплата, 	ЛОЖЬ) КАК БезналичнаяОплата,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.Доставка, 				ЛОЖЬ) КАК Доставка,
	|	ЕСТЬNULL(ВТ_ПараметрыРасчета.ГлавныйСкладСамовывоз,	ЛОЖЬ) КАК ГлавныйСкладСамовывоз,
	|	ЕСТЬNULL(ВТ_СтатусыЗаказов.СтатусЗаказа, ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаказовБитриксЗначения.ПустаяСсылка)) КАК СтатусЗаказа
	|ИЗ
	|	ВТ_Заказы КАК ВТ_Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПараметрыРасчета КАК ВТ_ПараметрыРасчета
	|		ПО ВТ_Заказы.Заказ = ВТ_ПараметрыРасчета.Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыЗаказов КАК ВТ_СтатусыЗаказов
	|		ПО ВТ_Заказы.Заказ = ВТ_СтатусыЗаказов.ЗаказСсылка
	|";
	
	Запрос.Параметры.Вставить("МассивЗаказов", МассивЗаказов);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции //--#1241 смарт: Лопато 25.01.2023	

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Процедура смартРассчитатьПараметрыЗаказа(МассивЗаказов, СтруктураДействийРасчета, НовыеЗначенияПараметровРасчета)

	СтруктураПараметровРасчета = Неопределено;
	
	Если СтруктураДействийРасчета.Свойство("Заказ") Тогда

	    Запрос = Новый Запрос;
	    Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказКлиента.Ссылка КАК Заказ,
		|	ЗаказКлиента.Склад КАК Склад,
		|	ВЫБОР
		|		КОГДА &УдалениеПроведения = ИСТИНА
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ЗаказКлиента.Проведен = ИСТИНА
		|	КОНЕЦ КАК Проведен,
		|	ЗаказКлиента.ПометкаУдаления = ИСТИНА КАК ПометкаУдаления,
		//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
		|	ЗаказКлиента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичная) 
		|		ИЛИ ЗаказКлиента.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка) КАК БезналичнаяОплата,
		//-- #2020 смарт: Лопато 29.08.2024
		|	ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.Самовывоз)
		|		ИЛИ ЗаказКлиента.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.смартСамовывозСоСкладаАдмирал) КАК Самовывоз,
		|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента
		|ПОМЕСТИТЬ ВТ_Заказы
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Ссылка В(&МассивЗаказов)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияЗаказовКлиентов.Заказ КАК Заказ,
		|	СостоянияЗаказовКлиентов.Состояние КАК Состояние,
		|	СостоянияЗаказовКлиентов.ПроцентОплаты КАК ПроцентОплаты,
		|	СостоянияЗаказовКлиентов.ПроцентОтгрузки КАК ПроцентОтгрузки
		|ПОМЕСТИТЬ ВТ_СостоянияЗаказовКлиентов
		|ИЗ
		|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО СостоянияЗаказовКлиентов.Заказ = ВТ_Заказы.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		//++ #2014 смарт: Лопато 23.08.2024 //Информирование клиентов о статусе заказа  
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказРезерв
		|ПОМЕСТИТЬ ВТ_НЕУстановленРезервВЗаказе
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_Заказы.Заказ
		|ГДЕ
		|	НЕ ЗаказКлиентаТовары.Ссылка.Проведен
		|		ИЛИ (НЕ ЗаказКлиентаТовары.Отменено
		|			 И НЕ (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Отгрузить)
		|				   ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.СоСклада)
		|				   ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.ОтгрузитьОбособленно)))
		//-- #2014 смарт: Лопато 23.08.2024
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказРезерв
		|;
		|
		//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказОбработаныСтроки
		|ПОМЕСТИТЬ ВТ_НЕОбработаныСрокиВЗаказе
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_Заказы.Заказ
		|ГДЕ
		|	(НЕ ЗаказКлиентаТовары.Ссылка.Проведен
		|			ИЛИ НЕ ЗаказКлиентаТовары.Отменено
		|				И (ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.НеТребуется)
		|					ИЛИ ЗаказКлиентаТовары.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.Требуется)))
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказОбработаныСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		//-- #2020 смарт: Лопато 29.08.2024
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказОтмена
		|ПОМЕСТИТЬ ВТ_ЕстьНеОтмененныеСтрокиВЗаказе
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО ЗаказКлиентаТовары.Ссылка = ВТ_Заказы.Заказ
		|ГДЕ
		|	НЕ ЗаказКлиентаТовары.Отменено
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказКлиентаТовары.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ЗаказОтмена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//++#1787 смарт: Лопато 18.04.2024 //Доработать алгоритм вычисления статуса заказа "Доставляется"  
		|	ВЫРАЗИТЬ(ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Документ.ЗаказКлиента) КАК Распоряжение
		|ПОМЕСТИТЬ ВТ_Доставка
		|ИЗ
		|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Заказы КАК ВТ_Заказы
		|		ПО (ВТ_Заказы.Заказ = ВЫРАЗИТЬ(ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Документ.ЗаказКлиента))
		|ГДЕ
		|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Проведен
		|	И ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаданийНаПеревозку.Формируется)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫРАЗИТЬ(ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Документ.ЗаказКлиента)
		//--#1787 смарт: Лопато 18.04.2024
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Заказы.Заказ КАК Заказ
		|ПОМЕСТИТЬ ВТ_ГлавныйСкладСамовывоз
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		//++ #2014 смарт: Лопато 23.08.2024 //Информирование клиентов о статусе заказа  
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСведенияОнлайнЗаказ 
		|	ПО ВЫРАЗИТЬ(ДопСведенияОнлайнЗаказ.Объект КАК Документ.ЗаказКлиента) = ВТ_Заказы.Заказ
		|	   И Свойство = &СвойствоОффлайнЗаказ 
		|	   И Значение = &ЗначениеОффлайнЗаказ
		//-- #2014 смарт: Лопато 23.08.2024
		|ГДЕ
		|	ВТ_Заказы.Склад В ИЕРАРХИИ(&СкладыДляСамовывозаСКассой)
		//++ #2014 смарт: Лопато 23.08.2024 //Информирование клиентов о статусе заказа  
		|   И НЕ ДопСведенияОнлайнЗаказ.Значение ЕСТЬ NULL
		//-- #2014 смарт: Лопато 23.08.2024
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ВТ_Заказы.Заказ,
		|	МАКСИМУМ(ВЫБОР
		|		КОГДА НЕ ЗаказКлиентаТовары.Номенклатура.ВидНоменклатуры.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|				И НЕ ЗаказКлиентаТовары.Отменено
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ) КАК ЕстьТовары
		|ПОМЕСТИТЬ ВТ_НаличиеТоваровВЗаказе
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО ВТ_Заказы.Заказ = ЗаказКлиентаТовары.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Заказы.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ВТ_Заказы.Заказ
		|;
		|
		//-- #Б3854 смарт: Шляпников 01.10.2025
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Заказы.Заказ КАК Заказ,
		|	ВТ_Заказы.Проведен = ИСТИНА КАК Проведен,
		|	ВТ_Заказы.ПометкаУдаления = ИСТИНА КАК ПометкаУдаления,
		|	ВТ_Заказы.БезналичнаяОплата КАК БезналичнаяОплата,
		|	ВТ_Заказы.Самовывоз КАК Самовывоз,
		|	ЕСТЬNULL(ВТ_СостоянияЗаказовКлиентов.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.Закрыт) КАК Закрыт,
		|	ЕСТЬNULL(ВТ_СостоянияЗаказовКлиентов.ПроцентОплаты, 0) >= 100 КАК Оплачен,
		|	ЕСТЬNULL(ВТ_СостоянияЗаказовКлиентов.ПроцентОтгрузки, 0) >= 100 КАК Отгружен,
		|	ВЫБОР
		|		КОГДА ВТ_НЕУстановленРезервВЗаказе.ЗаказРезерв ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
		|	КОНЕЦ КАК УстановленРезервНаСкладе,
		|	ВЫБОР
		|		КОГДА ВТ_НЕОбработаныСрокиВЗаказе.ЗаказОбработаныСтроки ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК УстановленРезерв,
		//-- #2020 смарт: Лопато 29.08.2024
		//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_НаличиеТоваровВЗаказе.ЕстьТовары, ЛОЖЬ) = ЛОЖЬ
		|				И ВТ_Заказы.СуммаДокумента > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ВЗаказеТолькоУслуги,
		//-- #Б3854 смарт: Шляпников 01.10.2025
		|	ВЫБОР
		|		КОГДА ВТ_ЕстьНеОтмененныеСтрокиВЗаказе.ЗаказОтмена ЕСТЬ NULL
		|				И ВТ_Заказы.СуммаДокумента = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтмененыСтроки,
		|	ВЫБОР
		|		КОГДА ВТ_Доставка.Распоряжение ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Доставка,
		|	ВЫБОР
		|		КОГДА ВТ_ГлавныйСкладСамовывоз.Заказ ЕСТЬ NULL
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК ГлавныйСкладСамовывоз
		|ИЗ
		|	ВТ_Заказы КАК ВТ_Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СостоянияЗаказовКлиентов КАК ВТ_СостоянияЗаказовКлиентов
		|		ПО ВТ_Заказы.Заказ = ВТ_СостоянияЗаказовКлиентов.Заказ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НЕУстановленРезервВЗаказе КАК ВТ_НЕУстановленРезервВЗаказе
		|		ПО ВТ_Заказы.Заказ = ВТ_НЕУстановленРезервВЗаказе.ЗаказРезерв
		//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НЕОбработаныСрокиВЗаказе КАК ВТ_НЕОбработаныСрокиВЗаказе
		|		ПО ВТ_Заказы.Заказ = ВТ_НЕОбработаныСрокиВЗаказе.ЗаказОбработаныСтроки
		//-- #2020 смарт: Лопато 29.08.2024
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕстьНеОтмененныеСтрокиВЗаказе КАК ВТ_ЕстьНеОтмененныеСтрокиВЗаказе
		|		ПО ВТ_Заказы.Заказ = ВТ_ЕстьНеОтмененныеСтрокиВЗаказе.ЗаказОтмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доставка КАК ВТ_Доставка
		|		ПО ВТ_Заказы.Заказ = ВТ_Доставка.Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГлавныйСкладСамовывоз КАК ВТ_ГлавныйСкладСамовывоз
		|		ПО ВТ_Заказы.Заказ = ВТ_ГлавныйСкладСамовывоз.Заказ
		//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаличиеТоваровВЗаказе КАК ВТ_НаличиеТоваровВЗаказе
		|		ПО ВТ_Заказы.Заказ = ВТ_НаличиеТоваровВЗаказе.Заказ
		//-- #Б3854 смарт: Шляпников 01.10.2025
		|";
		
		Запрос.Параметры.Вставить("МассивЗаказов", МассивЗаказов);
		
		МассивСкладовДляСамовывозаСКассой = смартОбщегоНазначения.ПолучитьСмартПредопределенноеЗначение(Справочники.смартПредопределенныеЗначения.СкладыДляСамовывозаСКассой, Истина);
		Запрос.Параметры.Вставить("СкладыДляСамовывозаСКассой", МассивСкладовДляСамовывозаСКассой);
		
		Если СтруктураДействийРасчета.Свойство("УдалениеПроведения") И СтруктураДействийРасчета.УдалениеПроведения = Истина Тогда
			Запрос.Параметры.Вставить("УдалениеПроведения", Истина);
		Иначе	
			Запрос.Параметры.Вставить("УдалениеПроведения", Ложь);
		КонецЕсли;	
		
		//++ #2014 смарт: Лопато 23.08.2024 //Информирование клиентов о статусе заказа  
		СвойствоОффлайнЗаказ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("ИдентификаторДляФормул", "ОффлайнЗаказ");
	    ЗначениеОффлайнЗаказ = "N";

		Запрос.Параметры.Вставить("СвойствоОффлайнЗаказ", СвойствоОффлайнЗаказ);
		Запрос.Параметры.Вставить("ЗначениеОффлайнЗаказ", ЗначениеОффлайнЗаказ);
		//-- #2014 смарт: Лопато 23.08.2024
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "Проведен");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "ПометкаУдаления");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "Закрыт");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "ОтмененыСтроки");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "УстановленРезерв");
			//++ #2020 смарт: Лопато 29.08.2024 //Исправить логику формирования статуса "Готов к выдаче"  
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "УстановленРезервНаСкладе");
			//-- #2020 смарт: Лопато 29.08.2024
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "Отгружен");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "Оплачен");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "Самовывоз");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "БезналичнаяОплата");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "Доставка");
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "ГлавныйСкладСамовывоз");
			//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
			смартУстановитьРассчитанныйПараметр(НовыеЗначенияПараметровРасчета, РезультатЗапроса, "ВЗаказеТолькоУслуги");
			//-- #Б3854 смарт: Шляпников 01.10.2025
			
		КонецЦикла;				
						
    КонецЕсли;

КонецПроцедуры //--#1241 смарт: Лопато 25.01.2023

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Процедура смартУстановитьРассчитанныйПараметр(ЗначенияПараметровРасчета, СтрокаРезультата, ПараметрРасчета)

	СтруктураПоиска = Новый Структура("Заказ", СтрокаРезультата.Заказ);
	НайденныеЗначения = ЗначенияПараметровРасчета.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрЗначения Из НайденныеЗначения Цикл
		СтрЗначения[ПараметрРасчета] = СтрокаРезультата[ПараметрРасчета];
	КонецЦикла;	
	
КонецПроцедуры //--#1241 смарт: Лопато 25.01.2023

//++#1241 смарт: Лопато 25.01.2023 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартЗаписатьРегистрСмартПараметрыРасчетаСтатусовЗаказовБитрикс(ТаблицаПараметровРасчета)
	
	Успех = Истина;
	
	ПериодЗаписи = ТекущаяДата();

	Для Каждого СтрокаНовыхПараметровРасчета Из ТаблицаПараметровРасчета Цикл
		
		МенеджерЗаписиПараметра = РегистрыСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписиПараметра, СтрокаНовыхПараметровРасчета);
		МенеджерЗаписиПараметра.Период = ПериодЗаписи;
		
		Попытка
        	МенеджерЗаписиПараметра.Записать();
		Исключение
			Успех = Ложь;
		КонецПопытки;
		
	КонецЦикла;	
		
	Возврат Успех;

КонецФункции //--#1241 смарт: Лопато 25.01.2023

//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартОчиститьРегистрПроцессов(Заказ)

    НаборЗаписей = РегистрыСведений.смартПроцессИзмененияСтатусовЗаказовБитрикс.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	    НаборЗаписей.Записать();
	КонецЕсли;	
		
КонецФункции //--#1241 смарт: Лопато 14.11.2022

//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартОчиститьРегистрПараметров(Заказ)

    НаборЗаписей = РегистрыСведений.смартПараметрыРасчетаСтатусовЗаказовБитрикс.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	    НаборЗаписей.Записать();
	КонецЕсли;	
		
КонецФункции //--#1241 смарт: Лопато 14.11.2022

//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартПолучитьСоответствиеСтатусовЗаказа()

	//Принят, ожидается оплата - P
	//Принят, ожидается отгрузка - ND
	////////////////Собирается - C
	////////////////Заказ собран - R
	//Заказ отменён - D
	//Доставляется - T
	/////////////////Отправлен курьером - DC
	/////////////////Передан в транспортную компанию - DT
	//Готов к выдаче - DP 
	//Заказ получен - OR;
	//Ожидается оплата - EP;
	////////////////Ожидается подтверждение документов - B
	//Выполнен - F
	//В обработке - N
	
	СоответствиеСтатусовЗаказа = Новый Соответствие;
	
	СоответствиеСтатусовЗаказа.Вставить("ВОбработке", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ВОбработке,              "N"));	
	СоответствиеСтатусовЗаказа.Вставить("НовыйОбъект", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ПринятОжидаетсяОплата,   "P"));
	СоответствиеСтатусовЗаказа.Вставить("Оплачен", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ПринятОжидаетсяОтгрузка, "ND"));	
	СоответствиеСтатусовЗаказа.Вставить("Доставляется", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.Доставляется,            "T"));	
	СоответствиеСтатусовЗаказа.Вставить("ГотовКВыдаче", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ГотовКВыдаче,            "DP"));	
	СоответствиеСтатусовЗаказа.Вставить("ОжидаетсяОплата", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ОжидаетсяОплата,         "EP"));	
	СоответствиеСтатусовЗаказа.Вставить("Отменен", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ЗаказОтменен,            "D"));	
	СоответствиеСтатусовЗаказа.Вставить("Завершен", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.Выполнен,                "F"));
	//++ #Б3854 смарт: Шляпников 01.10.2025 / Проект smart-t.ru. Исправить логику статусов Заказа клиента на сайте
	СоответствиеСтатусовЗаказа.Вставить("Получен", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ЗаказПолучен,            "OR"));
	СоответствиеСтатусовЗаказа.Вставить("ОжидаютсяДокументы", 
										Новый Структура("СтатусЗаказа, Идентификатор", Перечисления.смартСтатусыЗаказовБитриксЗначения.ОжидаютсяДокументы,      "B"));
	//-- #Б3854 смарт: Шляпников 01.10.2025
	
	Возврат СоответствиеСтатусовЗаказа;
	
КонецФункции //--#1241 смарт: Лопато 14.11.2022

//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартЗаписатьРегистрСмартПроцессИзмененияСтатусовЗаказовБитрикс(СтруктураЗаписиПроцесса)
	
	Отказ = Ложь;
	
	Попытка
		ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписиПроцесса, "СмартПроцессИзмененияСтатусовЗаказовБитрикс");
	Исключение
		ЗаписьЖурналаРегистрации("Проблема с проведением документа, не удалось записать статус документа в регистр СмартПроцессИзмененияСтатусовЗаказовБитрикс",
								 УровеньЖурналаРегистрации.Ошибка, СтруктураЗаписиПроцесса.Заказ, , ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции //--#1241 смарт: Лопато 14.11.2022

//++#1241 смарт: Лопато 14.11.2022 //Доработать алгоритм вычисления статуса заказа для сайта.  
Функция смартЗаписатьРегистрСмартСтатусыЗаказовБитрикс(СтруктураЗаписиСтатусыЗаказовБитрикс)
	
	Отказ = Ложь;
	
	Попытка
		ОбменДаннымиСлужебный.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписиСтатусыЗаказовБитрикс, "СмартСтатусыЗаказовБитрикс");	
	Исключение
		ЗаписьЖурналаРегистрации("Проблема с проведением документа, не удалось записать статус документа в регистр СмартСтатусыЗаказовБитрикс",
								 УровеньЖурналаРегистрации.Ошибка, СтруктураЗаписиСтатусыЗаказовБитрикс.СсылкаМет, , ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
	
	Возврат Отказ;
	
КонецФункции //--#1241 смарт: Лопато 14.11.2022

Функция ПорядокСтатуса(Статус)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СмартПорядокСтатусов.Статус КАК Статус,
	|	СмартПорядокСтатусов.Порядок КАК Порядок
	|ИЗ
	|	РегистрСведений.СмартПорядокСтатусов КАК СмартПорядокСтатусов
	|ГДЕ
	|	СмартПорядокСтатусов.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Статус);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.Порядок;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
	
Функция НайтиЗаявкуНаПеревозку(Заказ)
	
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка КАК Ссылка,
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение КАК Распоряжение,
	|	ЗаданиеНаПеревозкуРаспоряжения.Доставлено КАК Доставлено,
	|	ЗаданиеНаПеревозкуРаспоряжения.ДоставляетсяПолностью КАК ДоставляетсяПолностью,
	|	ЗаданиеНаПеревозкуРаспоряжения.Ссылка.Статус КАК Статус
	|ИЗ
	|	Документ.ЗаданиеНаПеревозку.Распоряжения КАК ЗаданиеНаПеревозкуРаспоряжения
	|ГДЕ
	|	ЗаданиеНаПеревозкуРаспоряжения.Распоряжение = &Распоряжение";
	Запрос.УстановитьПараметр("Распоряжение",Заказ);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.Статус;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

//Функция проверка оплаты по соглашению
Функция ЗаказОплаченЧастично(Заказ)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты > 0 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оплачен
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
 		Возврат Рез.Оплачен;
	КонецЕсли;
	Возврат 0;
КонецФункции 

Функция ЗаказОплаченПолностью(Заказ)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА СостоянияЗаказовКлиентов.ПроцентОплаты = 100 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Оплачен
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
 		Возврат Рез.Оплачен;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

//Функция проверка заказ собирается
Функция ЗаказСобирается(Заказ)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ТоварыКОтгрузкеОстатки.КСборкеОстаток КАК КСборкеОстаток
	                    |ИЗ
	                    |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки = &Заказ) КАК ТоварыКОтгрузкеОстатки
	                    |ГДЕ
	                    |	ТоварыКОтгрузкеОстатки.КСборкеОстаток > 0");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.КСборкеОстаток<>0;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

//Функция проверка заказ собиран
Функция ЗаказСобран(Заказ)
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток КАК КОтгрузке
	                    |ИЗ
	                    |	РегистрНакопления.ТоварыКОтгрузке.Остатки(, ДокументОтгрузки = &Заказ) КАК ТоварыКОтгрузкеОстатки
	                    |ГДЕ
	                    |	ТоварыКОтгрузкеОстатки.КОтгрузкеОстаток > 0");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.КОтгрузке<>0;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЗаказОжидаетДокументы(Заказ)
	
	//Вариант 1 Алексей Фролов
	//Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100
	//|				И СостоянияЗаказовКлиентов.ПроцентОплаты = 100
	//|				И НЕ СостоянияЗаказовКлиентов.Заказ.смартДокументыПодписаны
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ОжидаютсяДокументы
	//|ИЗ
	//|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	//|ГДЕ
	//|	СостоянияЗаказовКлиентов.Заказ = &Заказ");
	//Запрос.УстановитьПараметр("Заказ",Заказ);
	//Рез=Запрос.Выполнить().Выбрать();
	//Если Рез.Следующий() Тогда
	//	Возврат Рез.ОжидаютсяДокументы;
	//КонецЕсли;
	//Возврат Ложь;
	
	//	Вариант 2 Алексей Фролов
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	| ВЫБОР
	| КОГДА СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100
	| И СостоянияЗаказовКлиентов.ПроцентОплаты = 100
	| И СостоянияЗаказовКлиентов.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию)
	| И НЕ СостоянияЗаказовКлиентов.Заказ.смартДокументыПодписаны
	| ТОГДА ИСТИНА
	| ИНАЧЕ ЛОЖЬ
	| КОНЕЦ КАК ОжидаютсяДокументы
	|ИЗ
	| РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	| СостоянияЗаказовКлиентов.Заказ = &Заказ");
	
	
	//Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ВЫБОР
	//|		КОГДА СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100
	//|				И СостоянияЗаказовКлиентов.ПроцентОплаты = 100
	//|				И СостоянияЗаказовКлиентов.Состояние В (ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ГотовКЗакрытию), ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказовКлиентов.ВПРоцессеОтгрузки))
	//|				И ТоварыКОтгрузкеОбороты.КОтгрузкеРасход > 0
	//|				И НЕ СостоянияЗаказовКлиентов.Заказ.смартДокументыПодписаны
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ОжидаютсяДокументы
	//|ИЗ
	//|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Обороты КАК ТоварыКОтгрузкеОбороты
	//|		ПО (СостоянияЗаказовКлиентов.Заказ = ТоварыКОтгрузкеОбороты.ДокументОтгрузки)
	//|ГДЕ
	//|	СостоянияЗаказовКлиентов.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ОжидаютсяДокументы;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЗаказОжидаетОплату(Заказ)
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	//|		КОГДА СостоянияЗаказовКлиентов.Состояние = &Состояние
	//|				И СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100
	|		КОГДА СостоянияЗаказовКлиентов.ПроцентОтгрузки = 100
	|			И СостоянияЗаказовКлиентов.ПроцентОплаты < 100
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОжидаетсяОплата
	|ИЗ
	|	РегистрСведений.СостоянияЗаказовКлиентов КАК СостоянияЗаказовКлиентов
	|ГДЕ
	|	СостоянияЗаказовКлиентов.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ",Заказ);
//	Запрос.УстановитьПараметр("Состояние",Перечисления.СостоянияЗаказовКлиентов.ОжидаетсяОплатаПослеОтгрузки);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Рез.ОжидаетсяОплата;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ЗаказОтменен(Заказ)
	
	Запрос=Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	КОЛИЧЕСТВО(*) = СУММА(ВЫБОР
	|			КОГДА ЗаказКлиентаТовары.Отменено
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Отменен
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Заказ
	|	И ЗаказКлиентаТовары.Ссылка.Статус = &Статус");
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыЗаказовКлиентов.Закрыт);
	Рез=Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда 
		Если ТипЗнч(Рез.Отменен)=Тип("Null") Тогда
			Возврат Ложь;
		КонецЕсли;
		Возврат Рез.Отменен;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

Функция ЕстьДоставка(Заказ)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
	"ВЫБРАТЬ Первые 1
	|ТоварыКДоставке.ЗаданиеНаПеревозку КАК ЗаданиеНаПеревозку,
	|ТоварыКДоставке.Распоряжение КАК Распоряжение,
	|ТоварыКДоставке.Количество КАК Количество
	|ИЗ
	|	РегистрСведений.ТоварыКДоставке КАК ТоварыКДоставке
	|ГДЕ
	|	ТоварыКДоставке.Распоряжение = &Заказ";
	
    Запрос.УстановитьПараметр("Заказ", Заказ);
    РезультатЗапроса=Запрос.Выполнить(); 
    Выборка=РезультатЗапроса.Выбрать(); 
    
    Если Выборка.Следующий() Тогда
        Возврат Истина; 
    КонецЕсли;	  
    
    Возврат Ложь; 
   
КонецФункции

Функция ОстатокДопустимогоКредита(Договор, ДопустимыйКредит)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.СуммаОстаток + РасчетыСКлиентамиОстатки.ОтгружаетсяОстаток КАК ОстатокДолга
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(
	|		,
	|		АналитикаУчетаПоПартнерам В (
	|			ВЫБРАТЬ
	|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
	|			ИЗ
	|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
	|			ГДЕ
	|				АналитикаПоПартнерам.Договор = &Договор
	|			)
	|	) КАК РасчетыСКлиентамиОстатки
	|");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОстатокДопустимогоКредита = ДопустимыйКредит - Выборка.ОстатокДолга;
	Иначе
		ОстатокДопустимогоКредита = ДопустимыйКредит;
	КонецЕсли;
	
	Возврат ОстатокДопустимогоКредита;
	
КонецФункции

// Возвращает сумму просроченной задолженности по данным расчетов с клиентом
//
// Параметры:
//	Договор       - СправочникСсылка.Договор - Договор, по которому определяется задолженность клиента
//	ДатаДокумента - Дата - Дата документа, для которого выполняется контроль суммы просроченной задолженности.
//
// Возвращаемое значение:
//	Число
//
Функция СуммаПросроченнойЗадолженности(Договор, ДатаДокумента)
	
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	РасчетыСКлиентамиОстатки.ДолгОстаток КАК ПросроченнаяЗадолженность
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентамиПоСрокам.Остатки(
		|		,
		|		АналитикаУчетаПоПартнерам В (
		|			ВЫБРАТЬ
		|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
		|			ИЗ
		|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|			ГДЕ
		|				АналитикаПоПартнерам.Договор = &Договор
		|			) И ДатаПлановогоПогашения < &ПериодКонтроляСрокаДолга
		|	) КАК РасчетыСКлиентамиОстатки
		|
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.ДолгОстаток > 0
		|");
		Запрос.УстановитьПараметр("ПериодКонтроляСрокаДолга", НачалоДня(Макс(ТекущаяДатаСеанса(), ДатаДокумента)));
	Иначе
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВЫБОР КОГДА РасчетыСКлиентамиОстатки.СуммаОстаток >
		|			РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток ТОГДА
		|		РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток
		|	ИНАЧЕ
		|		РасчетыСКлиентамиОстатки.СуммаОстаток
		|	КОНЕЦ), 0) КАК ПросроченнаяЗадолженность
		|
		|ИЗ
		|	РегистрНакопления.РасчетыСКлиентами.Остатки(
		|		&ПериодКонтроляСрокаДолга,
		|		АналитикаУчетаПоПартнерам В (
		|			ВЫБРАТЬ
		|				АналитикаПоПартнерам.КлючАналитики КАК КлючАналитики
		|			ИЗ
		|				РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПоПартнерам
		|			ГДЕ
		|				АналитикаПоПартнерам.Договор = &Договор
		|			)
		|	) КАК РасчетыСКлиентамиОстатки
		|
		|ГДЕ
		|	РасчетыСКлиентамиОстатки.СуммаОстаток > 0
		|	И (РасчетыСКлиентамиОстатки.КОплатеОстаток - РасчетыСКлиентамиОстатки.ОплачиваетсяОстаток) > 0
		|");
		Запрос.УстановитьПараметр("ПериодКонтроляСрокаДолга", Макс(КонецДня(ТекущаяДатаСеанса()), КонецДня(ДатаДокумента)));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	Если Выборка.Следующий() Тогда
		СуммаПросроченнойЗадолженности = Выборка.ПросроченнаяЗадолженность;
	Иначе
		СуммаПросроченнойЗадолженности = 0;
	КонецЕсли;
	
	Возврат СуммаПросроченнойЗадолженности;
	
КонецФункции

Функция ПроверкаПолученияЗаказа(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	смартСтатусОтслеживаниеОтправленияСрезПоследних.СтатусЗадания КАК СтатусЗадания
		|ИЗ
		|	РегистрСведений.СмартСтатусОтслеживаниеОтправления.СрезПоследних КАК смартСтатусОтслеживаниеОтправленияСрезПоследних
		|ГДЕ
		|	смартСтатусОтслеживаниеОтправленияСрезПоследних.Заказ = &Заказ
		|	И смартСтатусОтслеживаниеОтправленияСрезПоследних.СтатусЗадания = &СтатусЗадания";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("СтатусЗадания", Перечисления.СтатусыЗаданийНаПеревозку.Закрыто);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
